bewd-todolist-user-auth/app/controllers/tasks_controller.rb

SELECT "tasks".* FROM "tasks" WHERE "tasks"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
DELETE FROM "tasks" WHERE "tasks"."id" = ?  [["id", 1]]
---
  def destroy
    @task = Task.find_by(id: params[:id])

    if @task&.destroy

SELECT "tasks".* FROM "tasks" WHERE "tasks"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "tasks" SET "completed" = ?, "updated_at" = ? WHERE "tasks"."id" = ?  [["completed", 1], ["updated_at", "2023-12-18 16:39:35.298165"], ["id", 1]]
---
  def mark_complete
    @task = Task.find_by(id: params[:id])

    render 'tasks/update' if @task&.update(completed: true)

SELECT "tasks".* FROM "tasks" WHERE "tasks"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "tasks" SET "completed" = ?, "updated_at" = ? WHERE "tasks"."id" = ?  [["completed", 0], ["updated_at", "2023-12-18 16:39:35.310050"], ["id", 1]]
---
  def mark_active
    @task = Task.find_by(id: params[:id])

    render 'tasks/update' if @task&.update(completed: false)