bewd-todolist-user-auth/app/controllers/users_controller.rb

  def create
    @user = User.new(user_params)
    if @user.save
---
INSERT INTO "users" ("username", "password", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["username", "test"], ["password", "asdasdasd"], ["created_at", "2023-12-18 15:34:21.377416"], ["updated_at", "2023-12-18 15:34:21.377416"]]